Revit 2027 API
LinePatternSegment.Length Property
 Gets and sets the length of the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Length { get; set; }
Public Property Length As Double
	Get
	Set
public:
property double Length {
	double get ();
	void set (double value);
}
member Length : float with get, set
Property Value
Double
 The length of the segment.
See Also
Reference
LinePatternSegment Class
Autodesk.Revit.DB Namespace